src/cf/Catalogs/ШаблоныГенерацииШтрихкодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ШаблоныГенерацииШтрихкодов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТаблицаНастройкиШаблонов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлинаДиапазона</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоДиапазона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>99</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецДиапазона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>99</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ШаблоныГенерацииШтрихкодов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СформироватьЗаголовокФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПроверкаПередЗаписью(Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	СформироватьЗаголовокФормы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьПересечениеНаСервере()
	ЕстьОшибки = Ложь;
	Для Каждого СтрокаТаблицы Из Объект.ТаблицаНастройкиШаблонов Цикл
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ШаблоныГенерацииШтрихкодовТаблицаНастройкиШаблонов.Ссылка КАК Ссылка,
		|	ШаблоныГенерацииШтрихкодовТаблицаНастройкиШаблонов.НачалоДиапазона КАК НачалоДиапазона,
		|	ШаблоныГенерацииШтрихкодовТаблицаНастройкиШаблонов.КонецДиапазона КАК КонецДиапазона,
		|	ШаблоныГенерацииШтрихкодовТаблицаНастройкиШаблонов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ШаблоныГенерацииШтрихкодовТаблицаНастройкиШаблонов.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Справочник.ШаблоныГенерацииШтрихкодов.ТаблицаНастройкиШаблонов КАК ШаблоныГенерацииШтрихкодовТаблицаНастройкиШаблонов
		|ГДЕ
		|	ШаблоныГенерацииШтрихкодовТаблицаНастройкиШаблонов.ДлинаДиапазона = &ДлинаДиапазона
		|	И ВЫБОР
		|			КОГДА ШаблоныГенерацииШтрихкодовТаблицаНастройкиШаблонов.НачалоДиапазона < &НачалоДиапазонаШтрихкода
		|					И ШаблоныГенерацииШтрихкодовТаблицаНастройкиШаблонов.КонецДиапазона < &НачалоДиапазонаШтрихкода
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ШаблоныГенерацииШтрихкодовТаблицаНастройкиШаблонов.НачалоДиапазона > &КонецДиапазонаШтрихкода
		|							И ШаблоныГенерацииШтрихкодовТаблицаНастройкиШаблонов.КонецДиапазона > &КонецДиапазонаШтрихкода
		|						ТОГДА ЛОЖЬ
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|		КОНЕЦ");
		Запрос.УстановитьПараметр("ДлинаДиапазона", СтрокаТаблицы.ДлинаДиапазона);
		Запрос.УстановитьПараметр("НачалоДиапазонаШтрихкода", СтрокаТаблицы.НачалоДиапазона);
		Запрос.УстановитьПараметр("КонецДиапазонаШтрихкода", СтрокаТаблицы.КонецДиапазона);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Выборка.Ссылка <> Объект.Ссылка Тогда
					ТекстСообщения = НСтр("ru = 'Диапазон штрихкодов %2 - %3 в строке %1 пересекается с диапазоном штрихкодов карт ""%5"" %6 - %7 в строке %4'");
					ЕстьОшибки = Истина;
				Иначе
					Если Выборка.НомерСтроки >= СтрокаТаблицы.НомерСтроки Тогда
						Продолжить;
					КонецЕсли;
					ТекстСообщения = НСтр("ru = 'Диапазон штрихкодов %2 - %3 в строке %1 пересекается с диапазоном штрихкодов %6 - %7 в строке %4'");
					ЕстьОшибки = Истина;
				КонецЕсли;
				ТекстШаблона = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ТекстСообщения,
					СтрокаТаблицы.НомерСтроки,                   //%1
					СтрокаТаблицы.НачалоДиапазона,      //%2
					СтрокаТаблицы.КонецДиапазона,       //%3
					Выборка.НомерСтроки,                    //%4
					Выборка.Ссылка,                       //%5
					Выборка.НачалоДиапазона,                //%6
					Выборка.КонецДиапазона); //%7
				
				ОбщегоНазначения.СообщитьПользователю(ТекстШаблона, Объект.Ссылка, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.ШаблоныГенерацииШтрихкодов", СтрокаТаблицы.НомерСтроки, "НачалоДиапазона"));
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Если Не ЕстьОшибки Тогда
		ТекстСообщения = НСтр("ru = 'Пересечений нет'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПересечение(Команда)
	ПроверитьПересечениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПередЗаписью(Отказ)
	ЕстьОшибки = Ложь;
	Для Каждого СтрокаТаблицы Из Объект.ТаблицаНастройкиШаблонов Цикл
		ДлинаНачалоДиапазона = СтрДлина(СтрокаТаблицы.НачалоДиапазона);
		ДлинаКонецДиапазона = СтрДлина(СтрокаТаблицы.КонецДиапазона);
		Если ДлинаНачалоДиапазона <> СтрокаТаблицы.ДлинаДиапазона Тогда
			ЕстьОшибки = Истина;
			ТекстОшибки = НСтр("ru = 'Количество символов начала диапазона в строке %1 не соответствует длине'");
		ИначеЕсли ДлинаКонецДиапазона <> СтрокаТаблицы.ДлинаДиапазона Тогда
			ЕстьОшибки = Истина;
			ТекстОшибки = НСтр("ru = 'Количество символов конец диапазона в строке %1 не соответствует длине'");
		КонецЕсли;
		Если ЕстьОшибки Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, СтрокаТаблицы.НомерСтроки);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, Объект.Ссылка, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.ШаблоныГенерацииШтрихкодов", СтрокаТаблицы.НомерСтроки, "НачалоДиапазона"));
			ЕстьОшибки = Ложь;
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовокФормы()
	Если ЗначениеЗаполнено(Объект.Наименование) Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = Объект.Наименование;
	Иначе
		АвтоЗаголовок = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
